{
    "country": "Belarus",
    "describe": "Belarus is a landlocked country in Eastern Europe, known for its Stalinist architecture, grand fortifications, and primeval forests. It shares borders with Russia, Ukraine, Poland, Lithuania, and Latvia. The country has a rich cultural heritage and a diverse landscape, ranging from vast forests to picturesque lakes.",
    "image_link": "https://example.com/image_of_belarus.jpg",
    "cities": [
        {
            "name": "🏙 Minsk",
            "geographical_location": "Located in the central part of Belarus, Minsk is the capital and largest city of the country.",
            "climate": "Minsk has a humid continental climate with cold winters and warm summers.",
            "famous_cuisine": "Draniki (potato pancakes), Machanka (pork stew), and Kolduny (dumplings).",
            "popular_attractions": [
                "Independence Square",
                "Minsk-Arena",
                "National Opera and Ballet Theatre",
                "Victory Park"
            ]
        },
        {
            "name": "🌳 Brest",
            "geographical_location": "Situated in the southwestern part of Belarus, near the border with Poland.",
            "climate": "Brest experiences a temperate continental climate with mild winters and warm summers.",
            "famous_cuisine": "Zurek (sour rye soup), Kletski (dumplings), and Borscht.",
            "popular_attractions": [
                "Brest Hero-Fortress",
                "Belovezhskaya Pushcha National Park",
                "Brest Railway Museum",
                "St. Nicholas Church"
            ]
        },
        {
            "name": "🏰 Grodno",
            "geographical_location": "Located in the western part of Belarus, close to the borders with Poland and Lithuania.",
            "climate": "Grodno has a humid continental climate with cold winters and warm summers.",
            "famous_cuisine": "Kletski (dumplings), Babka (potato pudding), and Krambambula (spiced honey vodka).",
            "popular_attractions": [
                "Old Grodno Castle",
                "Kalozha Church",
                "New Hrodna Castle",
                "Grodno Zoo"
            ]
        }
    ]
}