{
    "country": "Chad",
    "describe": "Chad is a landlocked country in north-central Africa. It is bordered by Libya to the north, Sudan to the east, the Central African Republic to the south, Cameroon and Nigeria to the southwest, and Niger to the west. Chad is known for its diverse cultures, languages, and landscapes, ranging from the Sahara Desert in the north to the fertile savannas in the south.",
    "image_link": "https://example.com/chad-image.jpg",
    "cities": [
        {
            "name": "🕌 N'Djamena",
            "geographical_location": "Located in the southwestern part of Chad, near the border with Cameroon.",
            "climate": "N'Djamena has a hot semi-arid climate with a wet season from June to September and a dry season from October to May.",
            "famous_cuisine": "Famous local dishes include Jarret de Boeuf (beef stew) and La Boule (millet porridge).",
            "popular_attractions": [
                "National Museum of Chad",
                "Avenue Charles de Gaulle",
                "Grand Mosque of N'Djamena"
            ]
        },
        {
            "name": "🌆 Moundou",
            "geographical_location": "Situated in the southern part of Chad, near the Logone River.",
            "climate": "Moundou has a tropical savanna climate with a distinct wet and dry season.",
            "famous_cuisine": "Known for its local beer Gala and dishes like Karkanji (hibiscus tea).",
            "popular_attractions": [
                "Gala Brewery",
                "Logone River",
                "Local markets"
            ]
        },
        {
            "name": "🏙 Abeche",
            "geographical_location": "Located in eastern Chad, it is the capital of the Ouaddaï Region.",
            "climate": "Abeche has a hot desert climate with very little rainfall throughout the year.",
            "famous_cuisine": "Popular dishes include Kisra (flatbread) and various meat stews.",
            "popular_attractions": [
                "Sultan's Palace",
                "Abeche Grand Mosque",
                "Local bazaars"
            ]
        }
    ]
}