{
    "country": "Honduras",
    "describe": "Honduras is a Central American country known for its rich natural resources, diverse wildlife, and vibrant culture. It is bordered by Guatemala, El Salvador, and Nicaragua, and has coastlines along the Caribbean Sea and the Pacific Ocean. The country is famous for its ancient Mayan ruins, lush rainforests, and beautiful beaches.",
    "image_link": "https://example.com/image-of-honduras.jpg",
    "cities": [
        {
            "name": "🏔 Tegucigalpa",
            "geographical_location": "Located in the southern-central highlands of Honduras.",
            "climate": "Tegucigalpa has a tropical savanna climate with a distinct wet and dry season.",
            "famous_cuisine": "Baleadas, a traditional Honduran dish made with flour tortillas, beans, cheese, and cream.",
            "popular_attractions": [
                "La Tigra National Park",
                "Parque Central",
                "Basilica de Suyapa"
            ]
        },
        {
            "name": "🌳 San Pedro Sula",
            "geographical_location": "Situated in the northwest of Honduras, in the Sula Valley.",
            "climate": "San Pedro Sula has a tropical rainforest climate with high humidity and rainfall throughout the year.",
            "famous_cuisine": "Sopa de Caracol, a conch soup that is a staple in Honduran cuisine.",
            "popular_attractions": [
                "Museum of Anthropology and History",
                "Cusuco National Park",
                "Zizima Eco Water Park"
            ]
        },
        {
            "name": "🏝 Roatán",
            "geographical_location": "An island in the Caribbean Sea, part of the Bay Islands of Honduras.",
            "climate": "Roatán has a tropical climate with warm temperatures year-round and a rainy season from October to January.",
            "famous_cuisine": "Seafood dishes, including grilled lobster and fried fish.",
            "popular_attractions": [
                "West Bay Beach",
                "Gumbalimba Park",
                "Roatán Marine Park"
            ]
        }
    ]
}